app/views/simulation/list.html.erb

SELECT "simulations".* FROM "simulations"
---

<% if @simulations.blank? %>
<h3>There are not any simulations currently in the system.</h3>
<% else %>
<table id = "simulations" class="table">
  <thead class="thead-light">
    <tr>
      <th>#</th>
      <th>Name</th>
      <th>Amount</th>
      <th>Actions</th>
    </tr>
  </thead>
  <tbody>
    <% @simulations.each_with_index do |simulation,idx| %>
    <tr>
      <td><%= idx+1 %>)</td>