app/views/simulation/show.html.erb

SELECT "loans".* FROM "loans" WHERE "loans"."simulation_id" = $1 LIMIT $2  [["simulation_id", 1], ["LIMIT", 1]]
---
                <tbody>
                    <% Loan.sort_margins(@simulation.loan.margins).each do |margin| %>