app/controllers/simulation_controller.rb

	def list
		@simulations = Simulation.all
---
SELECT "simulations".* FROM "simulations"

	def show
		@simulation = Simulation.find(params[:id])
---
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
	   @simulation = Simulation.find(params[:id])
---
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@simulation = Simulation.new(simulation_params)
		@loan = @simulation.build_loan(loan_params)

		@simulation_valid = @simulation.valid?
		@loan_valid = @loan.valid?

		if !@simulation_valid || !@loan_valid
			logger.debug "simulation.errors = #{@simulation.errors.full_messages.join("; ")}"
			logger.debug "loan.errors = #{@loan.errors.full_messages.join("; ")}"

			@currencies = SimulationController.currencies
			render :action => 'new'
		else
			if @simulation.save
---
SELECT "loans".* FROM "loans" WHERE "loans"."simulation_id" = $1 LIMIT $2  [["simulation_id", 1], ["LIMIT", 1]]
INSERT INTO "loans" ("simulation_id", "amount", "currency") VALUES ($1, $2, $3) RETURNING "id"  [["simulation_id", 1], ["amount", "100000.0"], ["currency", "PLN"]]
INSERT INTO "simulations" ("name") VALUES ($1) RETURNING "id"  [["name", "TEST 1"]]

	def update
	   	@simulation = Simulation.find(params[:id])
	   	@loan = @simulation.loan

		@simulation_valid = @simulation.valid?
		@loan_valid = @loan.valid?

		if !@simulation_valid || !@loan_valid
			logger.debug "simulation.errors = #{@simulation.errors.full_messages.join("; ")}"
			logger.debug "loan.errors = #{@loan.errors.full_messages.join("; ")}"

			@currencies = SimulationController.currencies
			render :action => 'edit'
		else
			if @simulation.update_attributes(simulation_params) && @loan.update_attributes(loan_params)
---
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "loans".* FROM "loans" WHERE "loans"."simulation_id" = $1 LIMIT $2  [["simulation_id", 1], ["LIMIT", 1]]
UPDATE "loans" SET "amount" = $1 WHERE "loans"."id" = $2  [["amount", "100001.0"], ["id", 1]]
UPDATE "simulations" SET "name" = $1 WHERE "simulations"."id" = $2  [["name", "TEST 1a"], ["id", 1]]

	def delete
		Simulation.find(params[:id]).destroy
---
DELETE FROM "simulations" WHERE "simulations"."id" = $1  [["id", 1]]
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]