app/controllers/simulation_controller.rb

    def create
        simulation = Simulation.build(simulation_params)
        simulation_valid = simulation.valid? && simulation.validate

        if !simulation_valid
            logger.debug "simulation.errors = #{simulation.errors.full_messages.join("; ")}"
            @simulation = simulation
            render :action => 'new'
        else
            if simulation.save
---
INSERT INTO "simulations" ("name") VALUES ($1) RETURNING "id"  [["name", "6"]]

    def update
        simulation = Simulation.find(params[:id])
        simulation.update(simulation_params)
---
SELECT "simulations".* FROM "simulations" WHERE "simulations"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "simulations" SET "name" = $1 WHERE "simulations"."id" = $2  [["name", "POPO III"], ["id", 24]]

    def delete
        Simulation.find(params[:id]).destroy
---
DELETE FROM "simulations" WHERE "simulations"."id" = $1  [["id", 18]]