app/controllers/simulation_controller.rb

    def edit
        @simulation = Simulation.find(params[:id])
        if !@simulation.loan.margins.any?
---
SELECT "loans".* FROM "loans" WHERE "loans"."simulation_id" = $1 LIMIT $2  [["simulation_id", 1], ["LIMIT", 1]]